{
  "basics": {
    "name": "Satyam Goyal",
    "label": "Computer Science Student",
    "email": "sagoyal@umich.edu",
    "phone": "",
    "url": "https://goyalsatyam.com",
    "summary": "Junior at the University of Michigan, majoring in Computer Science with a strong focus on AI and machine learning.",
    "location": {
      "city": "Newark",
      "countryCode": "US",
      "region": "California"
    },
    "profiles": [
      {
        "network": "GitHub",
        "username": "Satgoy152",
        "url": "https://github.com/Satgoy152"
      },
      {
        "network": "LinkedIn",
        "username": "Satyam Goyal",
        "url": "https://linkedin.com/in/satyam-goyal-me/"
      }
    ]
  },
  "education": [
    {
      "institution": "University of Michigan, Ann Arbor",
      "location": "Ann Arbor, Michigan",
      "area": "Computer Science",
      "studyType": "B.S.",
      "startDate": "2023-07-01",
      "endDate": "2026-05-01",
      "score": "3.95",
      "courses": [
        "442 (Computer Vision)",
        "445 (Machine Learning)",
        "281 (Data Structures)",
        "376 (Algorithm Design)",
        "STATS: 280 (Data Analysis)",
        "ROB: 101 (Linear Algebra)"
      ]
    }
  ],
  "skills": [
    {
      "name": "Programming Languages",
      "level": "",
      "keywords": ["Python", "Java", "C++", "Javascript", "SQL", "Ruby"]
    },
    {
      "name": "Machine Learning Tools",
      "level": "",
      "keywords": ["OpenAI", "LM Studio", "PostgreSQL (VectorDB)", "Langchain", "Pandas", "TensorFlow", "Pytorch", "Keras", "Scikit-Learn"]
    },
    {
      "name": "Cloud/Databases",
      "level": "",
      "keywords": ["AWS (EC2, Lambda, SES, Cloudwatch)", "Kubernetes", "Jenkins", "Docker", "CI/CD", "Firebase", "MySQL"]
    }
  ],
  "certificates": [
    {
      "name": "PCEP",
      "date": "2022-09",
      "issuer": "",
      "url": ""
    }
  ],
  "work": [
    {
      "name": "Optiwise Inc.",
      "position": "ML and Data Intern",
      "url": "",
      "startDate": "2024-05",
      "endDate": "2024-09",
      "summary": "Developed reports and databases from customer email data, created a recommendation system, and automated growth and marketing pipelines.",
      "highlights": [
        "Enabled execution of efficient marketing campaigns using AWS Lambda functions, SQL, and PowerBI.",
        "Improved user workflow by creating a recommendation system based on GPT4o, LangChain, and RAG.",
        "Boosted sales productivity and cross-functional collaboration with advanced data analysis."
      ]
    },
    {
      "name": "Harvard Medical School",
      "position": "Software Engineering Intern",
      "url": "",
      "startDate": "2022-06",
      "endDate": "2022-09",
      "summary": "Contributed to an open-source pipeline for microscopic image analysis.",
      "highlights": [
        "Decreased patient lab testing turnaround time by automating tasks.",
        "Created quantification modules for post-processed cell images."
      ]
    },
    {
      "name": "Open CV",
      "position": "Open Source Contributor",
      "url": "",
      "startDate": "2022-06",
      "endDate": "2022-09",
      "summary": "Published documentation and developed modules for object recognition and medical image processing.",
      "highlights": [
        "Made access to state-of-the-art libraries more accessible."
      ]
    }
  ],
  "research": [
    {
      "institution": "IBM",
      "position": "Research Assistant, First Author",
      "url": "",
      "startDate": "2024-05",
      "endDate": "2024-09",
      "summary": "Evaluated and benchmarked LLM model performance, developed an open-source dataset, and conducted research on improving LLM performance.",
      "highlights": [
        "Evaluating and benchmarking LLM (Claude, GPT, Llama) model performance on multi-modal linguistic tasks.",
        "Developing an open-source dataset of linguistic problems for training and testing transformer models.",
        "Conducted novel research in improving LLM performance on multivariate time-series prediction."
      ]
    },
    {
      "institution": "University of Michigan",
      "position": "Researcher",
      "url": "",
      "startDate": "2023-06",
      "endDate": "2023-09",
      "summary": "Developed and trained a deep learning model for generating color-corrected images to aid colorblind farmers.",
      "highlights": [
        "Developed and trained a deep learning Encoder-Decoder model using Tensorflow.",
        "Responsible for machine learning algorithm selection, feature engineering, data generation, and model training, evaluation, optimization, monitoring, and documentation.",
        "Constructed a novel architecture and loss-function to optimize training by 30%."
      ]
    },
    {
      "institution": "University of Michigan",
      "position": "Researcher",
      "url": "",
      "startDate": "2022-12",
      "endDate": "2023-09",
      "summary": "Enabled faster molecular property prediction using large-scale graph neural networks and improved model accuracy with fine-tuning on clathrate crystal structure data.",
      "highlights": [
        "Enabled exponentially faster molecular property prediction using large-scale graph neural networks.",
        "Improved model accuracy with fine-tuning on clathrate crystal structure data."
      ]
    }
  ],
  "projects": [
    {
      "name": "Tailored Academic & Resource Assistant (Tara)",
      "url": "https://talk2tara.streamlit.app/",
      "startDate": "2024-07",
      "endDate": "Present",
      "summary": "Developed an AI-Chatbot for University of Michigan students, providing personalized academic and career guidance.",
      "highlights": [
        "Developed an AI-Chatbot using advanced LLM and RAG technologies.",
        "Provided tailored recommendations and support by integrating real-time data on course offerings and student records.",
        "Doubled response quality and decreased costs by 40% using novel semantic chunking methods for efficient data retrieval."
      ]
    },
    {
      "name": "Myoga",
      "url": "",
      "startDate": "2022-06",
      "endDate": "2022-09",
      "summary": "Built an AI-based virtual yoga instructor to make reliable access to yoga education and feedback widely accessible.",
      "highlights": [
        "Tuned posture detection computer vision models for the purpose of yoga pose classification and assessment.",
        "Publication on calculating yoga pose error based on real-time human key points location.",
        "Currently over 3000 users."
      ]
    }
  ],
  "clubs": [
    {
      "organization": "CodeLab",
      "position": "Project Manager and Events Lead",
      "url": "",
      "startDate": "2022-10",
      "endDate": "2023-06",
      "summary": "Recruited by the largest tech-consulting group in UC Davis, developed a content generation tool for Optiwise.ai.",
      "highlights": [
        "Contracted by Optiwise.ai to develop a content generation tool that uses Natural Language Processing, Generative AI, and Image Processing.",
        "Automated the creation of high-quality content for sellers on Amazon and Walmart."
      ]
    }
  ]
}
